{"articles":[{"publish_date":"Wed, 11 Dec 2013 06:23:00 +0100","source":"CNN","source_url":"http:\/\/rss.cnn.com\/rss\/money_latest.rss","summary":"General Motors said Wednesday it will close its Holden production facilities\u000ain Australia, a move that will cost thousands of jobs and casts doubt on the\u000afuture of the country's struggling auto sector.\u000a\u000a","title":"GM to stop Holden production in Australia (CNN)","url":"http:\/\/news.feedzilla.com\/en_us\/stories\/346756766?q=australia&client_source=api&format=json"},{"publish_date":"Sun, 08 Dec 2013 22:15:00 +0100","source":"US Weekly","source_url":"http:\/\/www.usmagazine.com\/feeds\/moms_and_babies\/atom","summary":"A few days after their Dec. 3 yacht excursion, the Jolie-Pitt family stepped\u000aout again in Australia,[...]\u000a\u000a","title":"Angelina Jolie and Daughter Vivienne Wear Matching Outfits on Day Out: Pic (US Weekly)","url":"http:\/\/news.feedzilla.com\/en_us\/stories\/346260269?q=australia&client_source=api&format=json"},{"publish_date":"Tue, 17 Sep 2013 15:57:00 +0100","source":"smithsonianmag","source_url":"http:\/\/feeds.feedburner.com\/smithsonianmag\/science-nature\/wildlife","summary":"White whales, such as the recently spotted humpback nicknamed Migaloo, are\u000arare and elusive creatures. How many are there and why are they white?\u000a\u000a","title":"Call Me Migaloo: The Story Behind Real-Life White Whales (smithsonianmag)","url":"http:\/\/news.feedzilla.com\/en_us\/stories\/340748490?q=australia&client_source=api&format=json"},{"author":"The Editors","publish_date":"Fri, 06 Dec 2013 22:08:00 +0100","source":"Human Rights","source_url":"http:\/\/blog.amnestyusa.org\/feed\/","summary":"\"I did not feel like I was imprisoned. I did not feel alone, I knew that\u000apeople believed in me.\"\u000a\u000a","title":"“I Did Not Feel Alone, I Knew People Believed in Me” (Human Rights)","url":"http:\/\/news.feedzilla.com\/en_us\/stories\/345982633?q=australia&client_source=api&format=json"},{"publish_date":"Sun, 24 Nov 2013 20:55:00 +0100","source":"US Weekly","source_url":"http:\/\/www.usmagazine.com\/feeds\/moms_and_babies\/atom","summary":"On the red carpet, Angelina Jolie is often stoic, but when it comes to playing\u000awith her kids, the mo[...]\u000a\u000a","title":"Angelina Jolie Steps Out With Adorable Twins Vivienne and Knox For a Play Date: Pictures (US Weekly)","url":"http:\/\/news.feedzilla.com\/en_us\/stories\/343498869?q=australia&client_source=api&format=json"},{"author":"Bill Saporito","publish_date":"Wed, 04 Dec 2013 16:16:00 +0100","source":"timeblogs","source_url":"http:\/\/feeds2.feedburner.com\/timeblogs\/curious_capitalist","summary":"Fifty years after Ford first unveiled the Mustang at the New York World’s\u000aFair, the American automaker is betting a total redesign can make the vehicle\u000aappeal to drivers around the world. TIME got an exclusive look into the sixth-\u000ageneration Mustang's development, including these never-before-seen images of\u000athe car Ford will formally reveal tomorrow. The vehicle, which will go on sale\u000anext year as a 2015 model, is lower, sleeker and wider than the current\u000aMustang. The most notable difference: this is the first Mustang to be produced\u000afor foreign markets, as Ford tries to turn an American icon into its global\u000aflagship. Ford executives and engineers told TIME they found themselves\u000astraining to satisfy the demands of drivers in Europe and Asia, produce a\u000aMustang with right-side steering for the U.K., India and Australia, while\u000aretaining the performance American customers expect. At one point the project\u000ahad to be rebooted because original designs were not meeting these\u000arequirements, TIME has learned. That cost Ford millions. The new Mustang will\u000aalso have a surprise under the hood: an optional 4-cylinder, turbo-charged\u000aengine. It’s a nod to Europe, where gas prices are twice those in ...","title":"This Is What Ford’s All-New 2015 Mustang Really Looks Like (timeblogs)","url":"http:\/\/news.feedzilla.com\/en_us\/stories\/345453759?q=australia&client_source=api&format=json"},{"author":"The Huffington Post News Editors","publish_date":"Sat, 07 Dec 2013 04:55:00 +0100","source":"Huffington post","source_url":"http:\/\/feeds.huffingtonpost.com\/huffingtonpost\/raw_feed","summary":"You can now play the real life version of \"Mario Kart,\" if you go to\u000aAustralia.\u000a\u000aYouTube user Devin Graham posted a video of friends riding grass karts in\u000aKurrajong Heights, outside of Sydney.\u000a\u000aGraham and his friends managed to recreate the fast-paced intensity of a Mario\u000aKart game on a grassy hill, with rolling car tires taking the place of Koopa\u000ashells as they picked up speed, and the rough terrain of the course itself\u000asent more than a few racers flying.\u000a\u000a\u000aRead More...\u000a\u000aMore on Games\u000a\u000a","title":"Real World 'Mario Kart' Exists, And It Should Be In The 2016 Olympics (Huffington post)","url":"http:\/\/news.feedzilla.com\/en_us\/stories\/346055119?q=australia&client_source=api&format=json"},{"enclosures":[{"length":1,"media_type":"image\/jpeg","uri":"http:\/\/static.nme.com\/images\/article\/2013rollingstones-9_RJ290613.jpg"}],"publish_date":"Wed, 04 Dec 2013 14:01:00 +0100","source":"nmecom","source_url":"http:\/\/feeds2.feedburner.com\/nmecom\/rss\/newsxml","summary":"Band will perform in the Far East and Asia plus Australia and New Zealand next\u000ayear\u000a\u000a\u000a\u000a\u000a\u000a\u000a\u000a\u000a","title":"Mick Taylor to join The Rolling Stones for 2014 tour (nmecom)","url":"http:\/\/news.feedzilla.com\/en_us\/stories\/345451000?q=australia&client_source=api&format=json"},{"author":"Matt Peckham","publish_date":"Sun, 17 Nov 2013 20:50:00 +0100","source":"timeblogs","source_url":"http:\/\/feeds2.feedburner.com\/timeblogs\/nerd_world","summary":"Okay, so it's a jackpot Sony kind of knew it was going to hit before the\u000asystem launched, when it was telling everyone it'd pre-sold over a million\u000aPlayStation 4 units, so this just makes it official: Sony says the PS4 sold\u000aone million units during its first 24 hours on sale, starting from midnight\u000aFriday, November 15. I'm not sure if that's a record, because I'm not really\u000aup on game console launch records. When I spoke with Sony's Jack Tretton on\u000aWednesday morning, he was sure the system wouldn't so much break as shatter\u000alaunch sales figures, and if this wikia's NPD launch figures are accurate --\u000athat the next biggest record-setters were the PlayStation 2 and Nintendo DS,\u000aeach at half a million units sold during their respective launch weeks -- he'd\u000abe correct, though why Sony isn't saying as much in its press release is\u000aanyone's guess. The PS4 has so far only launched in North America, which has a\u000asmaller video game population than Europe, so the fireworks may just be\u000astarting. The PS4 rolls out in Europe (including the U.K.), Australia and\u000aBrazil on November 29, followed by ...","title":"Sony’s PlayStation 4 Hits the ‘Million Sold’ Jackpot (timeblogs)","url":"http:\/\/news.feedzilla.com\/en_us\/stories\/342085066?q=australia&client_source=api&format=json"},{"author":"<StaffMember: Pam Kragen>","publish_date":"Sat, 23 Nov 2013 23:00:00 +0100","source":"San Diego Union-Tribune","source_url":"http:\/\/www.utsandiego.com\/rss\/headlines\/communities\/north-county\/","summary":"For most of his life, John Pracy has struggled to solve the mystery of his\u000abirth. Last month, the 64-year-old retiree in Australia finally discovered the\u000aanswer in a tattered brown photo album half the world away in Poway.\u000a\u000a","title":"Photo brings together long-lost brothers (San Diego Union-Tribune)","url":"http:\/\/news.feedzilla.com\/en_us\/stories\/343405446?q=australia&client_source=api&format=json"},{"author":"TIME Staff","publish_date":"Thu, 14 Nov 2013 12:25:00 +0100","source":"timeblogs","source_url":"http:\/\/feeds2.feedburner.com\/timeblogs\/nerd_world","summary":"ABOUT THIS POLL The TIME Invention Poll, in cooperation with Qualcomm, was a\u000asurvey of 10,197 people in seven mature markets (South Korea, the U.S.,\u000aGermany, Sweden, Australia, the U.K. and Singapore) and 10 emerging markets\u000a(South Africa, Kenya, Russia, the United Arab Emirates, China, Brazil, Turkey,\u000aIndia, Mexico and Indonesia). To read more about the poll, click here. To see\u000athe full results of the poll, click here.\u000a\u000a","title":"The TIME Invention Poll (timeblogs)","url":"http:\/\/news.feedzilla.com\/en_us\/stories\/340572770?q=australia&client_source=api&format=json"},{"author":"Star Tribune Staff","publish_date":"Mon, 02 Dec 2013 17:20:00 +0100","source":"Minneapolis Star Tribune","source_url":"http:\/\/www.startribune.com\/rss\/?sf=1&s=\/","summary":"A brazen bird snatched a video camera that was recording crocodiles in\u000anorthwest Australia and captured fascinating footage of its 110-kilometer\u000a(70-mile) journey across the country's remote landscape.\u000a\u000a","title":"Bird snatches camera in Australia, records 70-mile journey (Minneapolis Star Tribune)","url":"http:\/\/news.feedzilla.com\/en_us\/stories\/345003679?q=australia&client_source=api&format=json"},{"author":"The Huffington Post News Editors","publish_date":"Sat, 30 Nov 2013 16:40:00 +0100","source":"Huffington post","source_url":"http:\/\/feeds.huffingtonpost.com\/huffingtonpost\/raw_feed","summary":"SYDNEY (AP) — A shark killed a teenager off Australia's east coast Saturday in\u000athe nation's second deadly attack this month, police said.\u000a\u000aZach Young, 19, was body boarding with three friends about 100 meters (330\u000afeet) offshore at Riecks Point, near the northern New South Wales city of\u000aCoffs Harbour, when he was bitten on the legs, New South Wales police said in\u000aa statement.\u000a\u000a\u000aRead More...\u000a\u000aMore on Shark Attacks\u000a\u000a","title":"Zach Young, Australian Shark Attack Victim, Dies At Riecks Point Near Coffs Harbour, New South Wales (Huffington post)","url":"http:\/\/news.feedzilla.com\/en_us\/stories\/344722123?q=australia&client_source=api&format=json"},{"publish_date":"Thu, 05 Dec 2013 14:54:00 +0100","source":"Detroit Free Press","source_url":"http:\/\/www.freep.com\/apps\/pbcs.dll\/section?category=business01&template=rss&mime=xml","summary":"Enthusiasts in Europe and Australia were among the first to see it. In\u000aDearborn, employees and dealers were invited to the standing-room only event\u000ato see the 2015 model that is lower, wider and sleeker than the outgoing\u000amodel.\u000a\u000a","title":"2015 Mustang unveiled to crowds around the world (Detroit Free Press)","url":"http:\/\/news.feedzilla.com\/en_us\/stories\/345660454?q=australia&client_source=api&format=json"},{"enclosures":[{"length":1,"media_type":"image\/jpeg","uri":"http:\/\/bloximages.newyork1.vip.townnews.com\/stltoday.com\/content\/tncms\/assets\/v3\/editorial\/5\/25\/525c606c-8cea-5b5c-8b7b-0733994aeaf9\/528316473fb02.preview-300.jpg"}],"publish_date":"Wed, 13 Nov 2013 11:05:00 +0100","source":"St. Louis Post-Dispatch","source_url":"http:\/\/www2.stltoday.com\/search\/?q=&d1=&d2=&s=start_time&sd=desc&c=sports\/college*&l=100&f=rss&t=article","summary":"Guard from Australia faces his former school for the first time tonight as SLU\u000amakes short trip.\u000a\u000a","title":"Ex-Billiken Salecich winds up playing for SIUE (St. Louis Post-Dispatch)","url":"http:\/\/news.feedzilla.com\/en_us\/stories\/340331143?q=australia&client_source=api&format=json"},{"enclosures":[{"length":1,"media_type":"image\/jpeg","uri":"http:\/\/static.nme.com\/images\/article\/TheInbetweeners01PR220811.jpg"}],"publish_date":"Mon, 02 Dec 2013 11:45:00 +0100","source":"nmecom","source_url":"http:\/\/feeds2.feedburner.com\/nmecom\/rss\/newsxml","summary":"Film is planned for August 2014 release\u000a\u000a\u000a\u000a\u000a\u000a\u000a\u000a\u000a","title":"'The Inbetweeners Movie 2' shooting in Australia this week (nmecom)","url":"http:\/\/news.feedzilla.com\/en_us\/stories\/344958944?q=australia&client_source=api&format=json"},{"author":"John J. Moser","publish_date":"Fri, 15 Nov 2013 13:26:00 +0100","source":"entertainment","source_url":"http:\/\/feeds2.feedburner.com\/entertainment\/music","summary":"Bruce Springsteen’s E Street Band is now in a better position than ever to\u000acontinue rolling on and there was talk about a movie version of “The Sopranos”\u000abut the death of James Gandolfini has silenced it forever, guitarist and...\u000a\u000a\u000a\u000a\u000a\u000a\u000a\u000a\u000a","title":"Steven Van Zandt says E Street Band will continue, 'The Sopranos' won't -- and his thoughts about whether 'Born to Run' almost died in Kutztown (entertainment)","url":"http:\/\/news.feedzilla.com\/en_us\/stories\/341701647?q=australia&client_source=api&format=json"},{"author":"The Huffington Post News Editors","publish_date":"Sun, 08 Dec 2013 14:48:00 +0100","source":"Huffington post","source_url":"http:\/\/feeds.huffingtonpost.com\/huffingtonpost\/raw_feed","summary":"We all know Naomie Harris is drop dead gorgeous. However, the \"Mandela: Long\u000aWalk to Freedom\" actress is proving that and more while on the film's world-\u000awide promo tour. From her stunning ensembles to her amazing hair, this lady\u000ahas some serious style chops. While attending the London premiere this week,\u000aNaomie donned a black, strapless Alexander McQueen gown with a gold beaded\u000apeplum. Trés chic! We can't wait to see what else this lady steps out in.\u000a\u000aThere was another British bombshell that caught our eye this week -- Naomi\u000aCampbell. The legendary supermodel was on hand fro the Foxtel Music Channels\u000aSummer Launch event in Sydney, Australia and showed off her fabulous figure in\u000aa sexy black lace gown. This woman can do no wrong!\u000a\u000aLast but not least, we're still drooling over Gabrielle Union's emerald-green\u000aPrada gown from the Alvin Ailey Gala this week. The \"Being Mary Jane\" actress\u000awas a vision of perfection.\u000a\u000a\u000aRead More...\u000a\u000aMore on Naomi Campbell\u000a\u000a","title":"Naomie Harris Is On A Serious Style Streak And More Of The Week's Best Fashion Moments (PHOTOS) (Huffington post)","url":"http:\/\/news.feedzilla.com\/en_us\/stories\/346224824?q=australia&client_source=api&format=json"},{"author":"admin","publish_date":"Tue, 10 Dec 2013 09:03:00 +0100","source":"Boots N All","source_url":"http:\/\/feeds.bootsnall.com\/bna\/articles\/","summary":"RTW travel is the best time to reinvent yourself and become more adventurous.\u000aThese six great risks made Emily Sussell's long-term travel the time of her\u000alife.\u000a\u000a","title":"Six Risks to Take That Will Improve Your Travels (Boots N All)","url":"http:\/\/news.feedzilla.com\/en_us\/stories\/346553633?q=australia&client_source=api&format=json"},{"author":"Alex Heigl","publish_date":"Tue, 12 Nov 2013 15:35:00 +0100","source":"People Magazine ","source_url":"http:\/\/feeds.people.com\/people\/headlines","summary":"Today is Ryan Gosling's 33rd birthday, and what better way to celebrate than\u000awith the news of his eerie twin?\u000a\u000a","title":"Ryan Gosling Appears to Have a Twin in Australia (People Magazine )","url":"http:\/\/news.feedzilla.com\/en_us\/stories\/340125564?q=australia&client_source=api&format=json"}],"description":"Top News - 'Australia'","syndication_url":"http:\/\/news.feedzilla.com\/en_us\/news.rss?q=australia&client_source=api","title":"Feedzilla: Top News - 'Australia'"}